configuration/Documents/fast8Задание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>fast8Задание</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.fast8ЗадачиНаКонтроле</xr:Item>
				<xr:Item>InformationRegister.fast8ЗадачиНаПроверке</xr:Item>
				<xr:Item>InformationRegister.fast8ЗадачиМоиНаПроверке</xr:Item>
				<xr:Item>InformationRegister.fast8ИсторияВыполненияЗаданий</xr:Item>
				<xr:Item>InformationRegister.fast8ЗадачиНаПросмотре</xr:Item>
				<xr:Item>InformationRegister.fast8ЗадачиНаНазначении</xr:Item>
				<xr:Item>InformationRegister.fast8ЗадачиНаИсполнении</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fast8Процессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fast8Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

configuration/InformationRegisters/fast8ИсторияВыполненияЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>fast8ИсторияВыполненияЗаданий</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fast8СтатусыЗаданий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fast8Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проверяющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fast8Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fast8Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fast8Процессы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.fast8Задание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

configuration/Enums/fast8СтатусыЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>fast8СтатусыЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначенИсполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПроверке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвращеноНаДоработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

configuration/Catalogs/fast8Процессы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>fast8Процессы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fast8Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяКонтроль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Создание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контроль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Управление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоРасписанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоПросмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расписание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:EnumRef.fast8ВидыПериодов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:EnumRef.fast8ВидыЕдиницПериода</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

configuration/Documents/fast8Задание/Ext/ManagerModule.bsl
//MIT License
//
//Copyright (c) 2023 FAST8.RU
//
//Permission is hereby granted, free of charge, to any person obtaining a copy
//of this software and associated documentation files (the "Software"), to deal
//in the Software without restriction, including without limitation the rights
//to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
//copies of the Software, and to permit persons to whom the Software is
//furnished to do so, subject to the following conditions:
//
//The above copyright notice and this permission notice shall be included in all
//copies or substantial portions of the Software.
//
//THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
//IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
//FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
//AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
//LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
//OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
//SOFTWARE.


Процедура СформироватьЗаписиСписковЗаданий(Задание) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	fast8ИсторияВыполненияЗаданийСрезПоследних.Процесс КАК Процесс,
	|	fast8ИсторияВыполненияЗаданийСрезПоследних.Задание КАК Задание,
	|	fast8ИсторияВыполненияЗаданийСрезПоследних.Статус КАК Статус,
	|	fast8ИсторияВыполненияЗаданийСрезПоследних.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ВТ_ТекущийСтатус
	|ИЗ
	|	РегистрСведений.fast8ИсторияВыполненияЗаданий.СрезПоследних(, Задание = &Задание) КАК fast8ИсторияВыполненияЗаданийСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""На исполнении"" КАК ИмяТаблицы,
	|	ВТ_ТекущийСтатус.Процесс КАК Процесс,
	|	ВТ_ТекущийСтатус.Задание КАК Задание,
	|	ВТ_ТекущийСтатус.Задание.Дата КАК Дата,
	|	fast8ПроцессыУчастники.Пользователь КАК Пользователь,
	|	ВТ_ТекущийСтатус.Статус КАК Статус,
	|	ВТ_ТекущийСтатус.Исполнитель КАК Исполнитель
	|ИЗ
	|	ВТ_ТекущийСтатус КАК ВТ_ТекущийСтатус
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.fast8Процессы.Участники КАК fast8ПроцессыУчастники
	|		ПО ВТ_ТекущийСтатус.Процесс = fast8ПроцессыУчастники.Ссылка
	|			И (ВТ_ТекущийСтатус.Статус = ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Новое))
	|			И (fast8ПроцессыУчастники.Исполнение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""На исполнении"",
	|	ВТ_ТекущийСтатус.Процесс,
	|	ВТ_ТекущийСтатус.Задание,
	|	ВТ_ТекущийСтатус.Задание.Дата,
	|	ВТ_ТекущийСтатус.Исполнитель,
	|	ВТ_ТекущийСтатус.Статус,
	|	ВТ_ТекущийСтатус.Исполнитель
	|ИЗ
	|	ВТ_ТекущийСтатус КАК ВТ_ТекущийСтатус
	|ГДЕ
	|	ВТ_ТекущийСтатус.Статус В (ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.НазначенИсполнитель), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.ПереданоВРаботу), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Выполняется), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.ВозвращеноНаДоработку))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""На назначении"" КАК ИмяТаблицы,
	|	ВТ_ТекущийСтатус.Процесс КАК Процесс,
	|	ВТ_ТекущийСтатус.Задание КАК Задание,
	|	ВТ_ТекущийСтатус.Задание.Дата КАК Дата,
	|	fast8ПроцессыУчастники.Пользователь КАК Пользователь,
	|	ВТ_ТекущийСтатус.Статус КАК Статус,
	|	ВТ_ТекущийСтатус.Исполнитель КАК Исполнитель
	|ИЗ
	|	ВТ_ТекущийСтатус КАК ВТ_ТекущийСтатус
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.fast8Процессы.Участники КАК fast8ПроцессыУчастники
	|		ПО ВТ_ТекущийСтатус.Процесс = fast8ПроцессыУчастники.Ссылка
	|			И (ВТ_ТекущийСтатус.Статус = ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Новое))
	|			И (fast8ПроцессыУчастники.Управление)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""На контроле"" КАК ИмяТаблицы,
	|	ВТ_ТекущийСтатус.Процесс КАК Процесс,
	|	ВТ_ТекущийСтатус.Задание КАК Задание,
	|	ВТ_ТекущийСтатус.Задание.Дата КАК Дата,
	|	fast8ПроцессыУчастники.Пользователь КАК Пользователь,
	|	ВТ_ТекущийСтатус.Статус КАК Статус,
	|	ВТ_ТекущийСтатус.Исполнитель КАК Исполнитель
	|ИЗ
	|	ВТ_ТекущийСтатус КАК ВТ_ТекущийСтатус
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.fast8Процессы.Участники КАК fast8ПроцессыУчастники
	|		ПО ВТ_ТекущийСтатус.Процесс = fast8ПроцессыУчастники.Ссылка
	|			И (fast8ПроцессыУчастники.Управление)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.fast8Процессы.Участники КАК fast8ПроцессыУчастникиПроверка
	|		ПО ВТ_ТекущийСтатус.Процесс = fast8ПроцессыУчастникиПроверка.Ссылка
	|			И ВТ_ТекущийСтатус.Исполнитель = fast8ПроцессыУчастникиПроверка.Пользователь
	|			И (fast8ПроцессыУчастникиПроверка.ТребуетсяКонтроль)
	|ГДЕ
	|	ВТ_ТекущийСтатус.Статус В (ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Новое), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.НазначенИсполнитель), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.ПереданоВРаботу), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Выполняется), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.ВозвращеноНаДоработку))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""На проверке"" КАК ИмяТаблицы,
	|	ВТ_ТекущийСтатус.Процесс КАК Процесс,
	|	ВТ_ТекущийСтатус.Задание КАК Задание,
	|	ВТ_ТекущийСтатус.Задание.Дата КАК Дата,
	|	fast8ПроцессыУчастники.Пользователь КАК Пользователь,
	|	ВТ_ТекущийСтатус.Статус КАК Статус,
	|	ВТ_ТекущийСтатус.Исполнитель КАК Исполнитель
	|ИЗ
	|	ВТ_ТекущийСтатус КАК ВТ_ТекущийСтатус
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.fast8Процессы.Участники КАК fast8ПроцессыУчастники
	|		ПО ВТ_ТекущийСтатус.Процесс = fast8ПроцессыУчастники.Ссылка
	|			И (ВТ_ТекущийСтатус.Статус = ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.НаПроверке))
	|			И (fast8ПроцессыУчастники.Контроль)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""На просмотре"" КАК ИмяТаблицы,
	|	ВТ_ТекущийСтатус.Процесс КАК Процесс,
	|	ВТ_ТекущийСтатус.Задание КАК Задание,
	|	ВТ_ТекущийСтатус.Задание.Дата КАК Дата,
	|	fast8ПроцессыУчастники.Пользователь КАК Пользователь,
	|	ВТ_ТекущийСтатус.Статус КАК Статус,
	|	ВТ_ТекущийСтатус.Исполнитель КАК Исполнитель
	|ИЗ
	|	ВТ_ТекущийСтатус КАК ВТ_ТекущийСтатус
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.fast8Процессы.Участники КАК fast8ПроцессыУчастники
	|		ПО ВТ_ТекущийСтатус.Процесс = fast8ПроцессыУчастники.Ссылка
	|			И (ВТ_ТекущийСтатус.Статус В (ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Новое), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.НазначенИсполнитель), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.ПереданоВРаботу), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Выполняется), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.ВозвращеноНаДоработку)))
	|			И (fast8ПроцессыУчастники.ТолькоПросмотр)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Мои на проверке"" КАК ИмяТаблицы,
	|	ВТ_ТекущийСтатус.Процесс КАК Процесс,
	|	ВТ_ТекущийСтатус.Задание КАК Задание,
	|	ВТ_ТекущийСтатус.Задание.Дата КАК Дата,
	|	ВТ_ТекущийСтатус.Исполнитель КАК Пользователь,
	|	ВТ_ТекущийСтатус.Статус КАК Статус,
	|	ВТ_ТекущийСтатус.Исполнитель КАК Исполнитель
	|ИЗ
	|	ВТ_ТекущийСтатус КАК ВТ_ТекущийСтатус
	|ГДЕ
	|	ВТ_ТекущийСтатус.Статус = ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.НаПроверке)";
	Запрос.УстановитьПараметр("Задание", Задание);
	
	Результат = Запрос.ВыполнитьПакет();
	
	РегистрыСтатусов = Новый Соответствие;
	РегистрыСтатусов.Вставить(1, "fast8ЗадачиНаИсполнении");
	РегистрыСтатусов.Вставить(2, "fast8ЗадачиНаНазначении");
	РегистрыСтатусов.Вставить(3, "fast8ЗадачиНаКонтроле");
	РегистрыСтатусов.Вставить(4, "fast8ЗадачиНаПроверке");
	РегистрыСтатусов.Вставить(5, "fast8ЗадачиНаПросмотре");
	РегистрыСтатусов.Вставить(6, "fast8ЗадачиМоиНаПроверке");
	
	Для Каждого РегистрСтатуса Из РегистрыСтатусов Цикл
		НаборЗаписей = РегистрыСведений[РегистрСтатуса.Значение].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Задание);
		НаборЗаписей.Загрузить(Результат.Получить(РегистрСтатуса.Ключ).Выгрузить());
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры // СформироватьЗаписиСписковЗаданий()
